<?php
    // Ξεκινάμε τη συνεδρία PHP
	session_start();
	
    // Ορίζουμε μια συνάρτηση για να ελέγχουμε τη σύνδεση του χρήστη και τον ρόλο του.
	function checkLoginAndRole($role) {
        // Ελέγχουμε αν δεν υπάρχει σύνολο session για το user_id ή αν ο ρόλος του χρήστη δεν είναι ο ίδιος με αυτόν που δόθηκε ως παράμετρος.
		if (!isset($_SESSION['user_id']) || $_SESSION['user_role'] != $role) {
            // Αν η παραπάνω συνθήκη είναι αληθής, τότε ανακατευθύνουμε τον χρήστη στη σελίδα σύνδεσης (login.php) και τερματίζουμε την εκτέλεση του κώδικα.
			header("Location: login.php");
			exit();
		}
	}
?>
